<?xml version="1.0" encoding="utf-8"?>
<DayEntry xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:newtelligence-com:dasblog:runtime:data">
  <Date>2009-03-11T01:00:00+01:00</Date>
  <Entries>
    <Entry>
      <Content>&lt;p&gt;Som du kanskje vet, p&amp;#229;g&amp;#229;r det for tiden en runde av MSDN Live, et arrangert i regi av Microsoft Norge. De har allerede bes&amp;#248;kt byene Stavanger og Bergen, og kommer til Trondheim i morgen, f&amp;#248;r de avslutter i Oslo.&lt;/p&gt;  &lt;p&gt;For f&amp;#248;rste gang i &lt;strike&gt;historien&lt;/strike&gt; nyere historie s&amp;#229; tar de betalt for dette arrangementet, og prisen er 1500 kr. Microsoft har begrunnet dette med at de ogs&amp;#229; er blitt et offer for finanskrisen, og m&amp;#229; stramme inn budsjettene som alle andre. &lt;/p&gt;  &lt;p&gt;Man kan jo argumentere med hvorfor i all verden vi skal finansiere Microsofts egen salgsturne? Det er jo et arrangement som tross alt genererer flere salg av deres egne produkter. Jeg velger &amp;#229; ikke ta stilling til denne diskusjonen, men heller fokusere p&amp;#229; det faglige. Microsoft har skapt en knakende bra faglige arena gjennom MSDN Live. Arrangement er gjennomf&amp;#248;rt med dyktige foredragsholdere og alltid relevant faglig innhold!&lt;/p&gt;  &lt;p&gt;B&amp;#248;rge Hansen som jobber i Microsoft forklarer p&amp;#229; hans &lt;a href="http://borge3000.no/2009/02/18/n-koster-msdn-live-penger-hvorfor-det/" target="_blank"&gt;blogg&lt;/a&gt; hvorfor arrangementet koster penger.&lt;/p&gt;  &lt;h3&gt;Hvorfor delta?&lt;/h3&gt;  &lt;p&gt;I v&amp;#229;r bransje foreg&amp;#229;r utviklingen veldig raskt, og hvis vi skal henge med p&amp;#229; dette s&amp;#229; m&amp;#229; vi holde oss oppdatert p&amp;#229; hva som skjer p&amp;#229; teknologifronten. Selv om vi er midt opp i en finanskrise og budsjettene strammes inn, m&amp;#229; vi fortsatt jobbe med kompetanseheving. I dag h&amp;#248;rte jeg et morsomt ordtak av en kollega av meg, som setter denne problemstilling p&amp;#229; spissen; &amp;#8221;Hvis du synes kompetanse er for dyrt&amp;#8230; fors&amp;#248;k uvitenhet&amp;#8221;. P&amp;#229; sikt vil d&amp;#229;rlig kompetanse koste veldig dyrt, det kan sammenlignes med og &amp;#8221;pisse&amp;#8221; i buksa n&amp;#229;r man fryser; f&amp;#248;rst det blir varmt i noen sekunder, f&amp;#248;r det blir ulevelig kaldt. &lt;/p&gt;  &lt;p&gt;Selv om du m&amp;#229; jobbe litt ekstra med &amp;#229; f&amp;#229; tillatelse fra din arbeidsgiver til &amp;#229; stille p&amp;#229; dette arrangementet pga. kostnad, s&amp;#229; mener jeg det er verdt det, for din egen del, og for din arbeidsgiver. Dette er en langsiktig investering! &lt;/p&gt;  &lt;p&gt;S&amp;#229; har vi jo ogs&amp;#229; det demokratiske aspektet; hvis den totale oppslutningen blir for d&amp;#229;rlig for dette arrangementet, s&amp;#229; vil vi som teknologer miste en fin arena &amp;#8211; noe vi ikke &amp;#248;nsker!&lt;/p&gt;  &lt;h3&gt;Hvordan har tilbakemeldingene v&amp;#230;rt s&amp;#229; langt?&lt;/h3&gt;  &lt;p&gt;Jeg har lest p&amp;#229; &lt;a href="http://blog.kjempekjekt.com/2009/03/10/geekbeer-geeksquad-og-msdnlive/" target="_blank"&gt;bloggen&lt;/a&gt; til Torbj&amp;#248;rn Mar&amp;#248;, er en systemutvikler fra Bergen og en aktiv blogger, han har f&amp;#248;lgende &amp;#229; si om MSDN Live arrangementet;&lt;/p&gt;  &lt;p&gt;&amp;#8221;Dagen inneholdt en rekke, gode sesjoner, og selv om MSDN Live kostet penger denne gangen var det relativt bra oppm&amp;#248;te.&amp;#8221;&lt;/p&gt;  &lt;p&gt;Du kan lese mer om Torbj&amp;#248;rns opplevelse p&amp;#229; hans &lt;a href="http://blog.kjempekjekt.com/2009/03/10/geekbeer-geeksquad-og-msdnlive/" target="_blank"&gt;blogg&lt;/a&gt;. &lt;/p&gt;  &lt;h3&gt;Hva b&amp;#248;r Microsoft gj&amp;#248;re neste gang?&lt;/h3&gt;  &lt;p&gt;Jeg har selv ingen problem med &amp;#229; betale 1500 kr for dette arrangementet. P&amp;#229; papiret ser dette arrangementet akkurat ut som de tidligere rundene av MSDN Live, og n&amp;#229;r dere plutselig begynner &amp;#229; ta betalt, s&amp;#229; hadde det v&amp;#230;rt en id&amp;#233; og gjort noe nytt. Jeg har f&amp;#248;lgende forslag til dere p&amp;#229; dette omr&amp;#229;det;&lt;/p&gt;  &lt;ul&gt;   &lt;li&gt;Inviter et stort navn til &amp;#229; holde keynote, for eksempel; Scott Guthrie, Scott Hanselman, Phil Hack, Jeremy Miller, Robert C. Martin etc &lt;/li&gt;    &lt;li&gt;Dere kunne ha kj&amp;#248;rt et ekspert track ved siden av det vanlige, med foredrag av faglig h&amp;#248;yt niv&amp;#229;, som er rettet mot ekspertene i de forskjellige byene &lt;/li&gt; &lt;/ul&gt;  &lt;p&gt;P&amp;#229; denne m&amp;#229;ten hadde dere gjort noe som er helt nytt, og dermed ville det v&amp;#230;rt enklere &amp;#229; forsvare gebyret p&amp;#229; 1500 kr.&lt;/p&gt;</Content>
      <Created>2009-03-11T14:23:48.4677777+01:00</Created>
      <Modified>2009-03-18T10:06:49.9578192+01:00</Modified>
      <EntryId>0813c450-52b8-441a-9251-dcb0a56e1545</EntryId>
      <Description />
      <Title>MSDN Live mars 2009</Title>
      <Categories>MSDN Live;Norwegian</Categories>
      <Author>admin</Author>
      <IsPublic>true</IsPublic>
      <Syndicated>true</Syndicated>
      <ShowOnFrontPage>true</ShowOnFrontPage>
      <AllowComments>true</AllowComments>
      <Attachments />
      <Crossposts />
    </Entry>
  </Entries>
</DayEntry>